Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/gpio.h
#define GPIO_SRCON0SET_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_SRCON0SET) Register Mask  */


/* -------- GPIO_SRCON0INV : (GPIO Offset: 0xCC) (R/W 32)  -------- */
#define GPIO_SRCON0INV_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_SRCON0INV)   Reset Value */

#define GPIO_SRCON0INV_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_SRCON0INV) Register Mask  */


/* -------- GPIO_SRCON1 : (GPIO Offset: 0xD0) (R/W 32)  -------- */
#define GPIO_SRCON1_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_SRCON1)   Reset Value */

#define GPIO_SRCON1_SR10_Pos                  _UINT32_(0)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR10_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR10_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR10(value)               (GPIO_SRCON1_SR10_Msk & (_UINT32_(value) << GPIO_SRCON1_SR10_Pos)) /* Assignment of value for SR10 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR11_Pos                  _UINT32_(1)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR11_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR11_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR11(value)               (GPIO_SRCON1_SR11_Msk & (_UINT32_(value) << GPIO_SRCON1_SR11_Pos)) /* Assignment of value for SR11 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR12_Pos                  _UINT32_(2)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR12_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR12_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR12(value)               (GPIO_SRCON1_SR12_Msk & (_UINT32_(value) << GPIO_SRCON1_SR12_Pos)) /* Assignment of value for SR12 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR13_Pos                  _UINT32_(3)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR13_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR13_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR13(value)               (GPIO_SRCON1_SR13_Msk & (_UINT32_(value) << GPIO_SRCON1_SR13_Pos)) /* Assignment of value for SR13 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR14_Pos                  _UINT32_(4)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR14_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR14_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR14(value)               (GPIO_SRCON1_SR14_Msk & (_UINT32_(value) << GPIO_SRCON1_SR14_Pos)) /* Assignment of value for SR14 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR15_Pos                  _UINT32_(5)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR15_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR15_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR15(value)               (GPIO_SRCON1_SR15_Msk & (_UINT32_(value) << GPIO_SRCON1_SR15_Pos)) /* Assignment of value for SR15 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR16_Pos                  _UINT32_(6)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR16_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR16_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR16(value)               (GPIO_SRCON1_SR16_Msk & (_UINT32_(value) << GPIO_SRCON1_SR16_Pos)) /* Assignment of value for SR16 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR17_Pos                  _UINT32_(7)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR17_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR17_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR17(value)               (GPIO_SRCON1_SR17_Msk & (_UINT32_(value) << GPIO_SRCON1_SR17_Pos)) /* Assignment of value for SR17 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR18_Pos                  _UINT32_(8)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR18_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR18_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR18(value)               (GPIO_SRCON1_SR18_Msk & (_UINT32_(value) << GPIO_SRCON1_SR18_Pos)) /* Assignment of value for SR18 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR19_Pos                  _UINT32_(9)                                          /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR19_Msk                  (_UINT32_(0x1) << GPIO_SRCON1_SR19_Pos)              /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR19(value)               (GPIO_SRCON1_SR19_Msk & (_UINT32_(value) << GPIO_SRCON1_SR19_Pos)) /* Assignment of value for SR19 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR110_Pos                 _UINT32_(10)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR110_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR110_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR110(value)              (GPIO_SRCON1_SR110_Msk & (_UINT32_(value) << GPIO_SRCON1_SR110_Pos)) /* Assignment of value for SR110 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR111_Pos                 _UINT32_(11)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR111_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR111_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR111(value)              (GPIO_SRCON1_SR111_Msk & (_UINT32_(value) << GPIO_SRCON1_SR111_Pos)) /* Assignment of value for SR111 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR112_Pos                 _UINT32_(12)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR112_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR112_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR112(value)              (GPIO_SRCON1_SR112_Msk & (_UINT32_(value) << GPIO_SRCON1_SR112_Pos)) /* Assignment of value for SR112 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR113_Pos                 _UINT32_(13)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR113_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR113_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR113(value)              (GPIO_SRCON1_SR113_Msk & (_UINT32_(value) << GPIO_SRCON1_SR113_Pos)) /* Assignment of value for SR113 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR114_Pos                 _UINT32_(14)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR114_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR114_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR114(value)              (GPIO_SRCON1_SR114_Msk & (_UINT32_(value) << GPIO_SRCON1_SR114_Pos)) /* Assignment of value for SR114 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_SR115_Pos                 _UINT32_(15)                                         /* (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR115_Msk                 (_UINT32_(0x1) << GPIO_SRCON1_SR115_Pos)             /* (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR115(value)              (GPIO_SRCON1_SR115_Msk & (_UINT32_(value) << GPIO_SRCON1_SR115_Pos)) /* Assignment of value for SR115 in the GPIO_SRCON1 register */
#define GPIO_SRCON1_Msk                       _UINT32_(0x0000FFFF)                                 /* (GPIO_SRCON1) Register Mask  */

